rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
#include "settings_screen.h"

#include <Arduino.h>
#include <Preferences.h>
#include <WiFi.h>
#include <esp32_smartdisplay.h>
#include <string.h>
#include <time.h>

#include "bambuddy_config.h"
#include "ui_layout.h"
#include "ui_theme.h"

// ============================================================
// Layout
// ============================================================
static constexpr int PAD = 12;
static constexpr int HEADER_H = 48;
static constexpr int ROW_H = 66;        // Touch-Ziel inkl. Untertitel
static constexpr int SLIDER_ROW_H = 96; // Titel oben, Slider darunter
static constexpr int EDIT_KB_H = 220;


// ============================================================
// Auswahllisten
// ============================================================

// Abfrageintervall waehrend eines Drucks. Im Leerlauf wird das Fuenffache
// verwendet (gedeckelt), da sich dort minutenlang nichts aendert.
static const uint32_t poll_intervals_ms[] = {1000, 2000, 5000, 10000, 30000};
static constexpr int POLL_COUNT = 5;
static constexpr int POLL_DEFAULT = 1; // 2 Sekunden
static constexpr uint32_t POLL_IDLE_MAX_MS = 30000;
static const char *poll_options = "1 Sekunde\n2 Sekunden\n5 Sekunden\n10 Sekunden\n30 Sekunden";

struct timezone_entry_t {
    const char *label;
    const char *posix;
};

// POSIX-Zeitzonen inklusive Sommerzeitregel — die Umstellung passiert damit
// automatisch, ohne dass das Geraet etwas nachladen muss.
static const timezone_entry_t timezones[] = {
    {"Berlin", "CET-1CEST,M3.5.0,M10.5.0/3"},
    {"London", "GMT0BST,M3.5.0/1,M10.5.0"},
    {"Athen", "EET-2EEST,M3.5.0/3,M10.5.0/4"},
    {"UTC", "UTC0"},
    {"New York", "EST5EDT,M3.2.0,M11.1.0"},
};
static constexpr int TZ_COUNT = 5;
static constexpr int TZ_DEFAULT = 0; // Berlin
static const char *tz_options = "Berlin\nLondon\nAthen\nUTC\nNew York";

// Zeit gilt als gueltig, wenn sie nach dem 15.11.2023 liegt —
// vorher steht die Uhr noch auf dem Startwert des Chips.
static constexpr time_t MIN_VALID_EPOCH = 1700000000;
static constexpr uint32_t NTP_RETRY_MS = 60000;

// ============================================================
// State
// ============================================================
static lv_obj_t *settings_list;
static lv_obj_t *dark_switch;
static lv_obj_t *tls_switch;
static lv_obj_t *poll_dd;
static lv_obj_t *tz_dd;
static lv_obj_t *brightness_slider;
static lv_obj_t *brightness_value_lbl;
static lv_obj_t *time_row_lbl;

static bool dark_mode = false;
static bool tls_verify = true;
static int brightness = 100;
static int poll_idx = POLL_DEFAULT;
static int tz_idx = TZ_DEFAULT;

static bool ntp_requested = false;
static uint32_t last_ntp_attempt_ms = 0;
static lv_timer_t *time_timer = nullptr;

static Preferences prefs;

// --- Textzeilen ---
#define MAX_TEXT_ROWS 16

struct text_row_t {
    const char *title;
    settings_get_fn get;
    settings_set_fn set;
    bool masked;
    bool numeric;
    lv_obj_t *value_lbl;
};

static text_row_t text_rows[MAX_TEXT_ROWS];
static int text_row_count = 0;

// --- Editor-Overlay ---
static lv_obj_t *edit_overlay = nullptr;
static lv_obj_t *edit_title;
static lv_obj_t *edit_ta;
static lv_obj_t *edit_kb;
static int edit_row_idx = -1;

// ============================================================
// Persistenz
// ============================================================

static void load_settings()
{
    prefs.begin("settings", true);
    dark_mode = prefs.getBool("dark", false);
    tls_verify = prefs.getBool("tls", true);
    brightness = prefs.getInt("bright", 100);
    poll_idx = prefs.getInt("poll", POLL_DEFAULT);
    tz_idx = prefs.getInt("tz", TZ_DEFAULT);
    prefs.end();

    if (poll_idx < 0 || poll_idx >= POLL_COUNT) poll_idx = POLL_DEFAULT;
    if (tz_idx < 0 || tz_idx >= TZ_COUNT) tz_idx = TZ_DEFAULT;
    if (brightness < 0 || brightness > 100) brightness = 100;
}

static void save_settings()
{
    prefs.begin("settings", false);
    prefs.putBool("dark", dark_mode);
    prefs.putBool("tls", tls_verify);
    prefs.putInt("bright", brightness);
    prefs.putInt("poll", poll_idx);
    prefs.putInt("tz", tz_idx);
    prefs.end();
}

// ============================================================
// Theme / Helligkeit / Zeit
// ============================================================

// lv_theme_default_init() initialisiert die Theme-Styles an Ort und Stelle neu
// und ruft lv_obj_report_style_change(NULL) auf, sobald das Theme bereits am
// Display haengt. Dadurch faerben sich auch bestehende Objekte sofort um —
// ein Neustart ist nicht noetig. Ausnahme: fest gesetzte Farben in eigenem
// Code (Akzent-, Warn- und Fehlerfarben) bleiben wie sie sind.
static void apply_theme()
{
    lv_display_t *disp = lv_display_get_default();
    lv_theme_t *th = lv_theme_default_init(disp,
                                           lv_palette_main(LV_PALETTE_BLUE),
                                           lv_palette_main(LV_PALETTE_RED),
                                           dark_mode,
                                           LV_FONT_DEFAULT);
    lv_display_set_theme(disp, th);
}

// Regler 0-100 auf 20-100% echte Helligkeit abbilden: ganz dunkel waere ein
// scheinbar totes Geraet, aus dem man sich nicht mehr herausklicken kann.
static float brightness_to_backlight(int value)
{
    return (20.0f + value * 0.8f) / 100.0f;
}

static void apply_brightness()
{
    smartdisplay_lcd_set_backlight(brightness_to_backlight(brightness));
}

static void apply_timezone()
{
    setenv("TZ", timezones[tz_idx].posix, 1);
    tzset();
    ntp_requested = false; // Sync mit neuer Zone erneut anstossen
}

// ============================================================
// Zeilen-Bausteine
// ============================================================

lv_obj_t *settings_add_section(const char *title)
{
    lv_obj_t *lbl = lv_label_create(settings_list);
    lv_label_set_text(lbl, title);
    lv_obj_set_width(lbl, LV_PCT(100));
    lv_obj_set_style_text_font(lbl, &lv_font_montserrat_12, 0);
    lv_obj_set_style_text_color(lbl, lv_color_hex(COL_MUTED), 0);
    lv_obj_set_style_pad_top(lbl, 6, 0);
    lv_obj_set_style_pad_left(lbl, 4, 0);
    return lbl;
}

static lv_obj_t *row_base(int height)
{
    lv_obj_t *row = lv_obj_create(settings_list);
    lv_obj_set_size(row, LV_PCT(100), height);
    lv_obj_remove_flag(row, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_style_radius(row, 10, 0);
    lv_obj_set_style_border_width(row, 0, 0);
    lv_obj_set_style_pad_hor(row, 14, 0);
    lv_obj_set_style_pad_ver(row, 0, 0);
    return row;
}

// Gemeinsamer Zeilenaufbau. sub_lbl_out liefert das Untertitel-Label zurueck,
// damit Zeilen ihren Wert spaeter aktualisieren koennen.
static lv_obj_t *row_create(const char *icon, const char *title, const char *subtitle,
                            lv_obj_t **sub_lbl_out)
{
    lv_obj_t *row = row_base(ROW_H);
    lv_obj_set_flex_flow(row, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(row, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    if (icon) {
        lv_obj_t *ic = lv_label_create(row);
        lv_label_set_text(ic, icon);
        lv_obj_set_style_pad_right(ic, 14, 0);
    }

    // Textspalte: waechst, damit das Bedienelement rechts buendig sitzt
    lv_obj_t *text_col = lv_obj_create(row);
    lv_obj_set_height(text_col, LV_SIZE_CONTENT);
    lv_obj_set_flex_grow(text_col, 1);
    lv_obj_remove_flag(text_col, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_remove_flag(text_col, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_set_style_bg_opa(text_col, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_width(text_col, 0, 0);
    lv_obj_set_style_pad_all(text_col, 0, 0);
    lv_obj_set_flex_flow(text_col, LV_FLEX_FLOW_COLUMN);

    lv_obj_t *title_lbl = lv_label_create(text_col);
    lv_label_set_text(title_lbl, title);
    lv_obj_set_width(title_lbl, LV_PCT(100));
    lv_label_set_long_mode(title_lbl, LV_LABEL_LONG_DOT);

    lv_obj_t *sub_lbl = nullptr;
    if (subtitle) {
        sub_lbl = lv_label_create(text_col);
        lv_label_set_text(sub_lbl, subtitle);
        lv_obj_set_width(sub_lbl, LV_PCT(100));
        lv_label_set_long_mode(sub_lbl, LV_LABEL_LONG_DOT);
        lv_obj_set_style_text_font(sub_lbl, &lv_font_montserrat_12, 0);
        lv_obj_set_style_text_color(sub_lbl, lv_color_hex(COL_MUTED), 0);
        lv_obj_set_style_pad_top(sub_lbl, 2, 0);
    }

