rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
    if (sub_lbl_out) *sub_lbl_out = sub_lbl;
    return row;
}

lv_obj_t *settings_add_row(const char *icon, const char *title, const char *subtitle)
{
    return row_create(icon, title, subtitle, nullptr);
}

lv_obj_t *settings_add_slider_row(const char *icon, const char *title,
                                  int32_t min, int32_t max, int32_t value,
                                  lv_event_cb_t cb, lv_obj_t **value_lbl_out)
{
    lv_obj_t *row = row_base(SLIDER_ROW_H);

    lv_obj_t *icon_lbl = nullptr;
    if (icon) {
        icon_lbl = lv_label_create(row);
        lv_label_set_text(icon_lbl, icon);
        lv_obj_align(icon_lbl, LV_ALIGN_TOP_LEFT, 0, 16);
    }

    lv_obj_t *title_lbl = lv_label_create(row);
    lv_label_set_text(title_lbl, title);
    lv_obj_align(title_lbl, LV_ALIGN_TOP_LEFT, icon ? 34 : 0, 16);

    lv_obj_t *value_lbl = lv_label_create(row);
    lv_obj_set_style_text_color(value_lbl, lv_color_hex(COL_MUTED), 0);
    lv_obj_align(value_lbl, LV_ALIGN_TOP_RIGHT, 0, 16);

    // Slider ueber die volle Zeilenbreite — auf einem Touchscreen ist ein
    // schmaler Regler neben dem Text kaum zu treffen.
    lv_obj_t *slider = lv_slider_create(row);
    lv_slider_set_range(slider, min, max);
    lv_slider_set_value(slider, value, LV_ANIM_OFF);
    lv_obj_set_width(slider, LV_PCT(100));
    lv_obj_align(slider, LV_ALIGN_BOTTOM_MID, 0, -18);
    lv_obj_add_event_cb(slider, cb, LV_EVENT_VALUE_CHANGED, nullptr);

    if (value_lbl_out) *value_lbl_out = value_lbl;
    return slider;
}

// ============================================================
// Textzeilen + Editor
// ============================================================

// Keys und Tokens nur angedeutet anzeigen — lang genug zum Wiedererkennen,
// kurz genug, dass niemand sie vom Display abschreibt.
static void format_value(const text_row_t &row, char *out, size_t out_len)
{
    const char *value = row.get ? row.get() : "";

    if (!value || value[0] == '\0') {
        strncpy(out, "nicht gesetzt", out_len - 1);
        out[out_len - 1] = '\0';
        return;
    }

    const size_t len = strlen(value);
    if (row.masked && len > 14) {
        snprintf(out, out_len, "%.6s ... %s", value, value + len - 4);
    } else {
        strncpy(out, value, out_len - 1);
        out[out_len - 1] = '\0';
    }
}

static void refresh_value_label(int idx)
{
    if (idx < 0 || idx >= text_row_count) return;

    text_row_t &row = text_rows[idx];
    char buf[64];
    format_value(row, buf, sizeof(buf));
    lv_label_set_text(row.value_lbl, buf);

    const char *value = row.get ? row.get() : "";
    const bool empty = (value == nullptr || value[0] == '\0');
    lv_obj_set_style_text_color(row.value_lbl,
                                lv_color_hex(empty ? COL_WARN : COL_MUTED), 0);
}

static void edit_close()
{
    edit_row_idx = -1;
    lv_obj_add_flag(edit_overlay, LV_OBJ_FLAG_HIDDEN);
}

static void edit_save_cb(lv_event_t *)
{
    if (edit_row_idx < 0) return;

    const int idx = edit_row_idx;
    text_row_t &row = text_rows[idx];
    if (row.set) row.set(lv_textarea_get_text(edit_ta));

    edit_close();
    refresh_value_label(idx);
}

static void edit_cancel_cb(lv_event_t *)
{
    edit_close();
}

static void edit_ta_cb(lv_event_t *e)
{
    const lv_event_code_t code = lv_event_get_code(e);
    if (code == LV_EVENT_READY) {
        edit_save_cb(e); // Haken auf der Tastatur = speichern
    } else if (code == LV_EVENT_CANCEL) {
        edit_close();
    }
}

// Overlay liegt auf lv_layer_top: immer ueber allen Screens, unabhaengig
// davon, welche Tileview-Kachel gerade sichtbar ist.
static void edit_overlay_create()
{
    edit_overlay = lv_obj_create(lv_layer_top());
    lv_obj_set_size(edit_overlay, SCREEN_W, SCREEN_H);
    lv_obj_align(edit_overlay, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_remove_flag(edit_overlay, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_style_radius(edit_overlay, 0, 0);
    lv_obj_set_style_border_width(edit_overlay, 0, 0);
    lv_obj_set_style_pad_all(edit_overlay, 0, 0);
    lv_obj_add_flag(edit_overlay, LV_OBJ_FLAG_HIDDEN);

    edit_title = lv_label_create(edit_overlay);
    lv_obj_set_style_text_font(edit_title, &lv_font_montserrat_16, 0);
    lv_obj_set_width(edit_title, SCREEN_W - 2 * PAD);
    lv_label_set_long_mode(edit_title, LV_LABEL_LONG_DOT);
    lv_obj_align(edit_title, LV_ALIGN_TOP_LEFT, PAD + 4, 18);

    edit_ta = lv_textarea_create(edit_overlay);
    lv_textarea_set_one_line(edit_ta, true);
    lv_obj_set_size(edit_ta, SCREEN_W - 2 * PAD, 52);
    lv_obj_align(edit_ta, LV_ALIGN_TOP_MID, 0, 56);
    lv_obj_add_event_cb(edit_ta, edit_ta_cb, LV_EVENT_READY, nullptr);
    lv_obj_add_event_cb(edit_ta, edit_ta_cb, LV_EVENT_CANCEL, nullptr);

    lv_obj_t *hint = lv_label_create(edit_overlay);
    lv_label_set_text(hint, "Wird sofort gespeichert.");
    lv_obj_set_style_text_font(hint, &lv_font_montserrat_12, 0);
    lv_obj_set_style_text_color(hint, lv_color_hex(COL_MUTED), 0);
    lv_obj_align(hint, LV_ALIGN_TOP_LEFT, PAD + 4, 116);

    lv_obj_t *cancel_btn = lv_button_create(edit_overlay);
    lv_obj_set_size(cancel_btn, 150, 46);
    lv_obj_align(cancel_btn, LV_ALIGN_TOP_LEFT, PAD, 146);
    lv_obj_set_style_bg_color(cancel_btn, lv_color_hex(0x546E7A), 0);
    lv_obj_add_event_cb(cancel_btn, edit_cancel_cb, LV_EVENT_CLICKED, nullptr);
    lv_obj_t *cancel_lbl = lv_label_create(cancel_btn);
    lv_label_set_text(cancel_lbl, LV_SYMBOL_CLOSE "  Abbrechen");
    lv_obj_center(cancel_lbl);

    lv_obj_t *save_btn = lv_button_create(edit_overlay);
    lv_obj_set_size(save_btn, SCREEN_W - 2 * PAD - 160, 46);
    lv_obj_align(save_btn, LV_ALIGN_TOP_RIGHT, -PAD, 146);
    lv_obj_set_style_bg_color(save_btn, lv_color_hex(COL_ACCENT), 0);
    lv_obj_add_event_cb(save_btn, edit_save_cb, LV_EVENT_CLICKED, nullptr);
    lv_obj_t *save_lbl = lv_label_create(save_btn);
    lv_label_set_text(save_lbl, LV_SYMBOL_SAVE "  Speichern");
    lv_obj_center(save_lbl);

    edit_kb = lv_keyboard_create(edit_overlay);
    lv_obj_set_size(edit_kb, SCREEN_W, EDIT_KB_H);
    lv_obj_align(edit_kb, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_keyboard_set_textarea(edit_kb, edit_ta);
}

