rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
static void edit_open(int idx)
{
    if (idx < 0 || idx >= text_row_count) return;
    if (!edit_overlay) edit_overlay_create();

    edit_row_idx = idx;
    const text_row_t &row = text_rows[idx];

    lv_label_set_text(edit_title, row.title);
    lv_keyboard_set_mode(edit_kb, row.numeric ? LV_KEYBOARD_MODE_NUMBER
                                              : LV_KEYBOARD_MODE_TEXT_LOWER);

    // Beim Bearbeiten immer im Klartext — sonst kann niemand pruefen,
    // ob der Key richtig angekommen ist.
    lv_textarea_set_text(edit_ta, row.get ? row.get() : "");

    lv_obj_remove_flag(edit_overlay, LV_OBJ_FLAG_HIDDEN);
    lv_obj_move_foreground(edit_overlay);
}

static void text_row_cb(lv_event_t *e)
{
    edit_open((int)(intptr_t)lv_event_get_user_data(e));
}

lv_obj_t *settings_add_text_row(const char *icon, const char *title,
                                settings_get_fn get, settings_set_fn set,
                                bool masked, bool numeric)
{
    if (text_row_count >= MAX_TEXT_ROWS) return nullptr;

    const int idx = text_row_count++;
    text_row_t &entry = text_rows[idx];
    entry.title = title;
    entry.get = get;
    entry.set = set;
    entry.masked = masked;
    entry.numeric = numeric;

    // Der Wert steht als Untertitel unter dem Namen — mehr Platz als eine
    // rechtsbuendige Spalte, und lange URLs bleiben lesbar.
    lv_obj_t *row = row_create(icon, title, "", &entry.value_lbl);
    lv_obj_add_flag(row, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_set_style_bg_color(row, lv_color_hex(COL_ACCENT), LV_STATE_PRESSED);
    lv_obj_add_event_cb(row, text_row_cb, LV_EVENT_CLICKED, (void *)(intptr_t)idx);

    // Chevron signalisiert: hier oeffnet sich etwas
    lv_obj_t *chevron = lv_label_create(row);
    lv_label_set_text(chevron, LV_SYMBOL_RIGHT);
    lv_obj_set_style_text_color(chevron, lv_color_hex(COL_MUTED), 0);
    lv_obj_set_style_pad_left(chevron, 10, 0);

    refresh_value_label(idx);
    return row;
}

// ============================================================
// NTP
// ============================================================

static void time_tick_cb(lv_timer_t *)
{
    const bool online = (WiFi.status() == WL_CONNECTED);
    const time_t now = time(nullptr);
    const bool valid = now >= MIN_VALID_EPOCH;

    if (online && !valid) {
        const uint32_t ms = millis();
        if (!ntp_requested || (ms - last_ntp_attempt_ms) >= NTP_RETRY_MS) {
            configTzTime(timezones[tz_idx].posix,
                         "de.pool.ntp.org", "pool.ntp.org", "time.nist.gov");
            ntp_requested = true;
            last_ntp_attempt_ms = ms;
            Serial.println("[Settings] NTP-Sync angefordert");
        }
    }

    if (!time_row_lbl) return;

    if (valid) {
        struct tm local_tm;
        localtime_r(&now, &local_tm);
        char buf[48];
        strftime(buf, sizeof(buf), "%d.%m.%Y  %H:%M:%S", &local_tm);
        lv_label_set_text(time_row_lbl, buf);
        lv_obj_set_style_text_color(time_row_lbl, lv_color_hex(COL_OK), 0);
    } else {
        lv_label_set_text(time_row_lbl, online ? "Synchronisiere ..." : "Wartet auf WLAN");
        lv_obj_set_style_text_color(time_row_lbl, lv_color_hex(COL_MUTED), 0);
    }
}

static void start_time_service()
{
    if (!time_timer) {
        time_timer = lv_timer_create(time_tick_cb, 1000, nullptr);
        lv_timer_set_repeat_count(time_timer, -1);
    }
    time_tick_cb(nullptr);
}

// ============================================================
// Callbacks
// ============================================================

static void dark_switch_cb(lv_event_t *)
{
    dark_mode = lv_obj_has_state(dark_switch, LV_STATE_CHECKED);
    apply_theme();
    save_settings();
}

static void tls_switch_cb(lv_event_t *)
{
    tls_verify = lv_obj_has_state(tls_switch, LV_STATE_CHECKED);
    save_settings();
    Serial.printf("[Settings] TLS-Pruefung: %s\n", tls_verify ? "an" : "AUS");
}

static void brightness_cb(lv_event_t *)
{
    brightness = lv_slider_get_value(brightness_slider);
    apply_brightness();
    lv_label_set_text_fmt(brightness_value_lbl, "%d%%", 20 + brightness * 80 / 100);
    save_settings();
}

static void poll_dd_cb(lv_event_t *)
{
    poll_idx = lv_dropdown_get_selected(poll_dd);
    save_settings();
}

static void tz_dd_cb(lv_event_t *)
{
    tz_idx = lv_dropdown_get_selected(tz_dd);
    apply_timezone();
    save_settings();
    time_tick_cb(nullptr); // Anzeige sofort aktualisieren
}

// Zahlen als Text fuer die Textzeilen
static const char *printer_id_get()
{
    static char buf[8];
    snprintf(buf, sizeof(buf), "%d", bambuddy_printer_id());
    return buf;
}

static const char *mqtt_port_get()
{
    static char buf[8];
    snprintf(buf, sizeof(buf), "%d", bambuddy_mqtt_port());
    return buf;
}

static void source_switch_cb(lv_event_t *e)
{
    lv_obj_t *sw = (lv_obj_t *)lv_event_get_target(e);
    const bool use_mqtt = lv_obj_has_state(sw, LV_STATE_CHECKED);
    bambuddy_set_source_mqtt(use_mqtt);
    Serial.printf("[Settings] Statusquelle: %s\n", use_mqtt ? "MQTT" : "HTTP");
}

// ============================================================
// Public API
// ============================================================

void settings_apply_saved()
{
    load_settings();
    apply_theme();
    apply_brightness();
    apply_timezone();
    // Die Uhr gehoert zur globalen Statusleiste und darf deshalb nicht vom
    // spaeter nur bei Bedarf erzeugten Einstellungs-Screen abhaengen.
    start_time_service();
}

void settings_screen_create(lv_obj_t *parent)
{
    lv_obj_remove_flag(parent, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *title = lv_label_create(parent);
    lv_label_set_text(title, LV_SYMBOL_SETTINGS "  Einstellungen");
    lv_obj_set_style_text_font(title, &lv_font_montserrat_16, 0);
    lv_obj_align(title, LV_ALIGN_TOP_LEFT, PAD + 52, 14);

    // Scrollbare Liste — neue Einstellungen haengen sich unten an,
    // ohne dass Positionen angepasst werden muessen.
    settings_list = lv_obj_create(parent);
    lv_obj_set_size(settings_list, SCREEN_W - 2 * PAD, CONTENT_H - HEADER_H - PAD);
    lv_obj_align(settings_list, LV_ALIGN_TOP_MID, 0, HEADER_H);
    lv_obj_set_style_bg_opa(settings_list, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_width(settings_list, 0, 0);
    lv_obj_set_style_pad_all(settings_list, 0, 0);
    lv_obj_set_style_pad_row(settings_list, 8, 0);
    lv_obj_set_flex_flow(settings_list, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_scroll_dir(settings_list, LV_DIR_VER);

    // --- Bambuddy-Verbindung ---
    settings_add_section("BAMBUDDY");

    settings_add_text_row(LV_SYMBOL_HOME, "Server-URL",
                          bambuddy_base_url, bambuddy_set_base_url, false, false);

