rico001/bambuddy-screen-4848S040CI-esp32/src/settings_screen.cpp
    settings_add_text_row(LV_SYMBOL_EYE_CLOSE, "API-Key",
                          bambuddy_api_key, bambuddy_set_api_key, true, false);

    settings_add_text_row(LV_SYMBOL_LIST, "Drucker-ID",
                          printer_id_get, bambuddy_set_printer_id, false, true);

    settings_add_text_row(LV_SYMBOL_VIDEO, "Kamera-Token",
                          bambuddy_cam_token, bambuddy_set_cam_token, true, false);

    lv_obj_t *poll_row = settings_add_row(LV_SYMBOL_REFRESH, "Aktualisierung",
                                          "Im Leerlauf automatisch seltener");
    poll_dd = lv_dropdown_create(poll_row);
    lv_dropdown_set_options(poll_dd, poll_options);
    lv_dropdown_set_selected(poll_dd, poll_idx);
    lv_obj_set_width(poll_dd, 150);
    lv_obj_add_event_cb(poll_dd, poll_dd_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    lv_obj_t *tls_row = settings_add_row(LV_SYMBOL_WARNING, "Zertifikat pruefen",
                                         "Nur zum Debuggen abschalten");
    tls_switch = lv_switch_create(tls_row);
    lv_obj_set_size(tls_switch, 58, 32);
    if (tls_verify) lv_obj_add_state(tls_switch, LV_STATE_CHECKED);
    lv_obj_add_event_cb(tls_switch, tls_switch_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    // --- MQTT ---
    settings_add_section("MQTT");

    lv_obj_t *source_row = settings_add_row(LV_SYMBOL_SHUFFLE, "Status per MQTT",
                                            "Aus: Status wird per HTTP abgefragt");
    lv_obj_t *source_switch = lv_switch_create(source_row);
    lv_obj_set_size(source_switch, 58, 32);
    if (bambuddy_source_mqtt()) lv_obj_add_state(source_switch, LV_STATE_CHECKED);
    lv_obj_add_event_cb(source_switch, source_switch_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    settings_add_text_row(LV_SYMBOL_WIFI, "Broker",
                          bambuddy_mqtt_host, bambuddy_set_mqtt_host, false, false);

    settings_add_text_row(LV_SYMBOL_DOWNLOAD, "Port",
                          mqtt_port_get, bambuddy_set_mqtt_port, false, true);

    settings_add_text_row(LV_SYMBOL_USB, "Benutzer",
                          bambuddy_mqtt_user, bambuddy_set_mqtt_user, false, false);

    settings_add_text_row(LV_SYMBOL_EYE_CLOSE, "Passwort",
                          bambuddy_mqtt_pass, bambuddy_set_mqtt_pass, true, false);

    settings_add_text_row(LV_SYMBOL_LIST, "Status-Topic",
                          bambuddy_mqtt_topic, bambuddy_set_mqtt_topic, false, false);

    // --- Darstellung ---
    settings_add_section("DARSTELLUNG");

    lv_obj_t *dark_row = settings_add_row(LV_SYMBOL_IMAGE, "Dark Mode",
                                          "Dunkles Farbschema fuer alle Screens");
    dark_switch = lv_switch_create(dark_row);
    lv_obj_set_size(dark_switch, 58, 32);
    if (dark_mode) lv_obj_add_state(dark_switch, LV_STATE_CHECKED);
    lv_obj_add_event_cb(dark_switch, dark_switch_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    brightness_slider = settings_add_slider_row(LV_SYMBOL_SETTINGS, "Helligkeit",
                                                0, 100, brightness,
                                                brightness_cb, &brightness_value_lbl);
    lv_label_set_text_fmt(brightness_value_lbl, "%d%%", 20 + brightness * 80 / 100);

    // --- Zeit ---
    settings_add_section("ZEIT");

    lv_obj_t *tz_row = settings_add_row(LV_SYMBOL_GPS, "Zeitzone",
                                        "Sommerzeit wird automatisch umgestellt");
    tz_dd = lv_dropdown_create(tz_row);
    lv_dropdown_set_options(tz_dd, tz_options);
    lv_dropdown_set_selected(tz_dd, tz_idx);
    lv_obj_set_width(tz_dd, 150);
    lv_obj_add_event_cb(tz_dd, tz_dd_cb, LV_EVENT_VALUE_CHANGED, nullptr);

    // Untertitel dieser Zeile dient als Sync-Statusanzeige
    row_create(LV_SYMBOL_BELL, "Uhrzeit", "", &time_row_lbl);

    time_tick_cb(nullptr);
}

void settings_screen_destroy()
{
    if (edit_overlay) {
        lv_obj_delete(edit_overlay);
        edit_overlay = nullptr;
    }

    settings_list = nullptr;
    dark_switch = nullptr;
    tls_switch = nullptr;
    poll_dd = nullptr;
    tz_dd = nullptr;
    brightness_slider = nullptr;
    brightness_value_lbl = nullptr;
    time_row_lbl = nullptr;
    edit_title = nullptr;
    edit_ta = nullptr;
    edit_kb = nullptr;
    edit_row_idx = -1;
    memset(text_rows, 0, sizeof(text_rows));
    text_row_count = 0;
}

bool settings_dark_mode() { return dark_mode; }

uint32_t settings_poll_interval_ms() { return poll_intervals_ms[poll_idx]; }

uint32_t settings_poll_interval_idle_ms()
{
    const uint32_t idle = poll_intervals_ms[poll_idx] * 5;
    return idle > POLL_IDLE_MAX_MS ? POLL_IDLE_MAX_MS : idle;
}

bool settings_tls_verify() { return tls_verify; }

const char *settings_timezone() { return timezones[tz_idx].posix; }

bool settings_time_synced() { return time(nullptr) >= MIN_VALID_EPOCH; }
